rawneo/matrix-display/esp8266/src/main.cpp
// Matrix Display — ESP8266 (NodeMCU v2) port of the Raspberry Pi app.py
// 7x MAX7219 FC-16 chain: DIN=D7(GPIO13), CLK=D5(GPIO14), CS=D8(GPIO15)
// DHT11 on D2 (GPIO4). Web UI + live canvas replica on http://<ip>/

#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
#include <ESP8266HTTPClient.h>
#include <WiFiClientSecureBearSSL.h>
#include <ArduinoOTA.h>
#include <time.h>
#include <math.h>
#include <SPI.h>
#include <MD_Parola.h>
#include <MD_MAX72xx.h>
#include <ArduinoJson.h>
#include <DHTesp.h>
#include "config.h"
#if ENABLE_MQTT
#include <PubSubClient.h>
#endif

#define HARDWARE_TYPE MD_MAX72XX::FC16_HW
#define CS_PIN 15  // D8
#define PANEL_W (MAX_DEVICES * 8)

MD_Parola parola(HARDWARE_TYPE, CS_PIN, MAX_DEVICES);
MD_MAX72XX *mx;
ESP8266WebServer server(80);
DHTesp dht;
#if ENABLE_MQTT
WiFiClient mqttNet;
PubSubClient mqtt(mqttNet);
#endif

// ---------------------------------------------------------------- modes ----
enum Mode {
  M_CLOCK, M_TEXT, M_WEATHER, M_DHT, M_CHARSET, M_PACMAN, M_DANCER,
  M_KITT, M_EQ, M_RAIN, M_FIREWORKS, M_STARFIELD, M_ECG, M_IP
};
Mode mode = M_IP;
uint32_t lastFrame = 0;   // millis of last animation frame
uint32_t frameNo = 0;     // per-mode frame counter

char textMsg[160];        // current scroll message (text/weather/dht/ip)
char timeOverride[8] = "";   // test pattern for the clock face (e.g. "88:88")

// ------------------------------------------------------------- sprites ----
const uint8_t RUNNER_FRAMES[4][8] PROGMEM = {
  {0x18,0x18,0x5A,0x3C,0x18,0x18,0x24,0x42},
  {0x18,0x18,0x3C,0x18,0x18,0x18,0x18,0x3C},
  {0x18,0x18,0x5A,0x3C,0x18,0x18,0x42,0x24},
  {0x18,0x18,0x3C,0x18,0x18,0x18,0x18,0x3C},
};
const uint8_t PACMAN_LEFT[2][8] PROGMEM = {
  {0x3C,0x7E,0x1F,0x0F,0x0F,0x1F,0x7E,0x3C},
  {0x3C,0x7E,0xFF,0xFF,0xFF,0xFF,0x7E,0x3C},
};
const uint8_t PACMAN_RIGHT[2][8] PROGMEM = {
  {0x3C,0x7E,0xF8,0xF0,0xF0,0xF8,0x7E,0x3C},
  {0x3C,0x7E,0xFF,0xFF,0xFF,0xFF,0x7E,0x3C},
};
const uint8_t GHOST_FRAMES[2][8] PROGMEM = {
  {0x3C,0x7E,0xDB,0xFF,0xFF,0xFF,0xFF,0xAA},
  {0x3C,0x7E,0xDB,0xFF,0xFF,0xFF,0xFF,0x55},
};
const uint8_t DANCER_FRAMES[4][8] PROGMEM = {
  {0x00,0x18,0x18,0x7E,0x18,0x18,0x18,0x3C},   // arms-out bop
  {0x00,0x18,0x18,0xF8,0x18,0x18,0x1E,0x10},   // kick right / arms left
  {0x00,0x18,0x5A,0x18,0x18,0x18,0x18,0x3C},   // arms up
  {0x00,0x18,0x18,0x1F,0x18,0x18,0x78,0x08},   // kick left / arms right
};
const uint8_t SHIP[8] PROGMEM = {0x00,0x00,0x0C,0x1E,0x7F,0x1E,0x0C,0x00};

// ECG: one heartbeat (PQRST), row values, baseline 5
const uint8_t ECG_BEAT[26] PROGMEM = {5,5,5,5,5,5,4,4,5,5,5,6,0,7,5,5,5,4,3,4,5,5,5,5,5,5};

// ------------------------------------------------------- pixel helpers ----
static inline void px(int x, int y, bool on = true) {
  if (x < 0 || x >= PANEL_W || y < 0 || y >= 8) return;
#if ROTATE_180
  x = PANEL_W - 1 - x;
  y = 7 - y;
#endif
#if FLIP_X
  mx->setPoint(y, PANEL_W - 1 - x, on);
#else
  mx->setPoint(y, x, on);
#endif
}

static inline bool getPx(int x, int y) {
#if ROTATE_180
  x = PANEL_W - 1 - x;
  y = 7 - y;
#endif
#if FLIP_X
  return mx->getPoint(y, PANEL_W - 1 - x);
#else
  return mx->getPoint(y, x);
#endif
}

void blit(const uint8_t *sprite /*PROGMEM*/, int x0, int y0 = 0) {
  for (int r = 0; r < 8; r++) {
    uint8_t bits = pgm_read_byte(sprite + r);
    for (int c = 0; c < 8; c++)
      if (bits & (1 << (7 - c))) px(x0 + c, y0 + r);
  }
}

void frameBegin() { mx->clear(); }
void frameEnd()   { mx->update(); }

// ------------------------------------------------------ panel keep-alive ----
// The MAX7219s are initialised exactly ONCE, by parola.begin() in setup().
// They power up in shutdown mode, so if a chip ever loses its control
// registers -- a brownout, ESD, or just a slow/noisy 5V ramp when the unit is
// replugged -- it goes dark and STAYS dark. The chain is write-only, so
// nothing detects it and the firmware keeps happily shifting pixel data into
// a switched-off display.
//
// That is exactly what happened 2026-08-12: after a replug, 6 of 7 modules
// were dark while the frame buffer, the date scroller and the web server were
// all provably healthy (buffer updating every frame, 0 stalls, 18ms median).
// Only one module had caught the boot-time init. A reboot fixed it.
//
// Note setIntensity() is ALREADY re-sent every frame from tickClock(), which
// is why the panel can look "addressed" and still be blank -- INTENSITY is not
// the register that matters here, SHUTDOWN is.
//
// SECOND failure mode, seen 2026-08-12 a few hours later: one module lit up
// with ALL 64 LEDs at full brightness while the other six went dark. That is
// DISPLAY TEST mode (MD_MAX72XX::TEST -> OP_DISPLAYTEST, register 0x0F), which
// overrides intensity and scan limit. It is also self-sustaining: a module at
// full brightness draws far more than the clock face ever does, sagging the
// shared 5V rail enough to knock the other chips out. TEST is therefore part
// of the keep-alive set -- the first version of this function asserted
// SHUTDOWN/SCANLIMIT/DECODE only, and could not clear a chip stuck in test.
//
// Re-asserting the control registers periodically makes the panel self-heal in
// seconds instead of needing a power cycle. The writes are no-ops when the
// chips are already configured. Intensity is deliberately NOT touched, so the
// 21:00-06:00 night dim and the animation fades keep control of it.
#define PANEL_REINIT_MS 5000
uint32_t lastPanelInit = 0;

void panelKeepAlive() {
  if (millis() - lastPanelInit < PANEL_REINIT_MS) return;
  lastPanelInit = millis();
  mx->control(0, MAX_DEVICES - 1, MD_MAX72XX::SHUTDOWN, MD_MAX72XX::OFF);
  mx->control(0, MAX_DEVICES - 1, MD_MAX72XX::TEST, MD_MAX72XX::OFF);
  mx->control(0, MAX_DEVICES - 1, MD_MAX72XX::SCANLIMIT, MAX_SCANLIMIT);
  mx->control(0, MAX_DEVICES - 1, MD_MAX72XX::DECODE, MD_MAX72XX::OFF);
}

// ------------------------------------------------------------- weather ----
const char *wmoText(int code) {
  switch (code) {
    case 0: case 1: return "Clear";
    case 2: return "Partly Cloudy";
    case 3: return "Overcast";
    case 45: case 48: return "Fog";
    case 51: case 53: case 55: return "Drizzle";
    case 56: case 57: return "Icy Drizzle";
    case 61: case 63: return "Rain";
    case 65: return "Heavy Rain";
    case 66: case 67: return "Freezing Rain";
    case 71: case 73: case 77: return "Snow";
    case 75: return "Heavy Snow";
    case 80: case 81: return "Showers";
    case 82: return "Heavy Showers";
    case 85: case 86: return "Snow Showers";
    case 95: case 96: case 99: return "Thunderstorm";
    default: return "";
  }
}

bool fetchWeather(char *out, size_t outlen) {
  if (WiFi.status() != WL_CONNECTED) return false;
  std::unique_ptr<BearSSL::WiFiClientSecure> client(new BearSSL::WiFiClientSecure);
  client->setInsecure();
  client->setBufferSizes(1024, 512);
  HTTPClient https;
  String url = F("https://api.open-meteo.com/v1/forecast?latitude=" WEATHER_LAT
                 "&longitude=" WEATHER_LON
                 "&current=temperature_2m,relative_humidity_2m,weather_code&timezone=auto");
  if (!https.begin(*client, url)) return false;
  int rc = https.GET();
  if (rc != HTTP_CODE_OK) { https.end(); return false; }
  JsonDocument doc;
  DeserializationError err = deserializeJson(doc, https.getString());
  https.end();
  if (err) return false;
  float t = doc["current"]["temperature_2m"] | NAN;
  int   h = doc["current"]["relative_humidity_2m"] | -1;
  int   c = doc["current"]["weather_code"] | -1;
  if (isnan(t)) return false;
  const char *desc = wmoText(c);
  if (h >= 0 && desc[0])
    snprintf(out, outlen, "%s  %.0fC  %s  Hum %d%%", WEATHER_CITY, t, desc, h);
  else
    snprintf(out, outlen, "%s  %.0fC", WEATHER_CITY, t);
  return true;
}

bool readDht(char *out, size_t outlen) {
  TempAndHumidity th = dht.getTempAndHumidity();
  if (dht.getStatus() != DHTesp::ERROR_NONE || isnan(th.temperature)) return false;
  snprintf(out, outlen, "Room Temp %.0fC  Hum %.0f%%", th.temperature, th.humidity);
  return true;
}

// -------------------------------------------------------- mode control ----
void startScroll(const char *msg) {
  parola.displayClear();
#if ROTATE_180
  // Panel is upside down: logical right-scroll reads as left-scroll.
  parola.displayScroll(msg, PA_RIGHT, PA_SCROLL_RIGHT, 50);
#else
  parola.displayScroll(msg, PA_LEFT, PA_SCROLL_LEFT, 50);
#endif
}

void switchMode(Mode m) {
  mode = m;
  frameNo = 0;
  lastFrame = 0;
  parola.setIntensity(DEFAULT_INTENSITY);
  parola.displayClear();
  switch (m) {
    case M_CLOCK:
      timeOverride[0] = 0;   // leaving/re-entering clock clears any test pattern
      break;
    case M_TEXT:
    case M_IP:
      startScroll(textMsg);
      break;
    case M_WEATHER:
      if (!fetchWeather(textMsg, sizeof(textMsg)))
        strlcpy(textMsg, "WEATHER N/A", sizeof(textMsg));
      startScroll(textMsg);
      break;
    case M_DHT:
      if (!readDht(textMsg, sizeof(textMsg)))
        strlcpy(textMsg, "DHT11 no data", sizeof(textMsg));
      startScroll(textMsg);
      break;
    default:
      break;
  }
}

// ------------------------------------------------------------ M_CLOCK -----
// Render a string into font-column bytes (1 blank col between chars).
// Returns the number of columns used.
int buildCols(const char *s, uint8_t *cols, int maxCols) {
  int n = 0;
  uint8_t cbuf[8];
  for (const char *p = s; *p && n < maxCols - 7; p++) {
    uint8_t w = mx->getChar((uint8_t)*p, sizeof(cbuf), cbuf);
    for (uint8_t i = 0; i < w; i++) cols[n++] = cbuf[i];
    cols[n++] = 0;
  }
  return n;
}

static inline void putCol(int x, uint8_t bits) {
  for (int r = 0; r < 8; r++)
    if (bits & (1 << r)) px(x, r);
}

// Like buildCols, but double-strikes each glyph (1px smear) for a bold face.
int buildColsBold(const char *s, uint8_t *cols, int maxCols) {
  int n = 0;
  uint8_t cbuf[8];
  for (const char *p = s; *p && n < maxCols - 9; p++) {
    if (*p == ':') { cols[n++] = 0x24; cols[n++] = 0; continue; }  // small colon dots
    if (*p == ' ') { cols[n++] = 0x00; cols[n++] = 0; continue; }  // blink-off, same width
    uint8_t w = mx->getChar((uint8_t)*p, sizeof(cbuf), cbuf);
    uint8_t prev = 0;
    for (uint8_t i = 0; i < w; i++) { cols[n++] = cbuf[i] | prev; prev = cbuf[i]; }
    cols[n++] = prev;   // finish the trailing smear column
    cols[n++] = 0;      // spacing
  }
  return n;
}

