rawneo/matrix-display/esp8266/src/main.cpp
uint8_t dateCols[200];
int dateNCols = 0, dateScroll = 0, lastDay = -1;
#define DATE_GAP 10   // blank cols between scroll repeats
#define TIME_REGION 24   // modules 1-3 (brighter vendor): time; 4-7: date scroller
#define TIME_GAP 1    // blank separator col so the scroller doesn't touch the time

// LCD_FONT digits from the original Pi build (luma.core legacy LCD_FONT,
// proportional-trimmed; bit0 = top row). Layout mirrors the Pi's clock face:
// hours at x=0, TINY_FONT colon at x=11, minutes at x=13 -> 24px total.
const uint8_t LCD_DIGITS[11][5] PROGMEM = {
  {0x3E, 0x51, 0x49, 0x45, 0x3E},  // 0
  {0x42, 0x7F, 0x40, 0x00, 0x00},  // 1 (3 cols wide)
  {0x42, 0x61, 0x51, 0x49, 0x46},  // 2
  {0x21, 0x41, 0x45, 0x4B, 0x31},  // 3
  {0x18, 0x14, 0x12, 0x7F, 0x10},  // 4
  {0x27, 0x45, 0x45, 0x45, 0x39},  // 5
  {0x3C, 0x4A, 0x49, 0x49, 0x30},  // 6
  {0x01, 0x71, 0x09, 0x05, 0x03},  // 7
  {0x36, 0x49, 0x49, 0x49, 0x36},  // 8
  {0x06, 0x49, 0x49, 0x29, 0x1E},  // 9
  {0x08, 0x08, 0x08, 0x08, 0x08},  // -
};
const uint8_t LCD_W[11] = {5, 3, 5, 5, 5, 5, 5, 5, 5, 5, 5};

static int glyphIdx(char c) { return (c == '-') ? 10 : c - '0'; }

// Full LCD_FONT (space..'z') ported from the same luma.core.legacy.font
// table the digits above came from, so the day/date scroller can share the
// exact clock typeface instead of the MD_MAX72XX library's default font.
#include "lcd_font_table.h"

int buildColsLCD(const char *s, uint8_t *cols, int maxCols) {
  int n = 0;
  for (const char *p = s; *p && n < maxCols - 6; p++) {
    uint8_t c = (uint8_t)*p;
    int idx = (c >= LCD_FONT_LO && c <= LCD_FONT_HI) ? c - LCD_FONT_LO : 0;
    uint8_t w = pgm_read_byte(&LCD_FONT_W[idx]);
    for (uint8_t i = 0; i < w; i++) cols[n++] = pgm_read_byte(&LCD_FONT_TABLE[idx][i]);
    cols[n++] = 0;
  }
  return n;
}

int drawTimeGlyph(int x, char c) {
  int idx = glyphIdx(c);
  for (int i = 0; i < LCD_W[idx]; i++)
    putCol(x + i, pgm_read_byte(&LCD_DIGITS[idx][i]));
  return LCD_W[idx];
}

// s is "HH:MM" (':' swapped for ' ' during blink-off)
void drawTimeLCD(const char *s) {
  int x = 0;
  x += drawTimeGlyph(x, s[0]) + 1;
  drawTimeGlyph(x, s[1]);
  if (s[2] == ':') putCol(11, 0x14);   // TINY_FONT colon, same as the Pi
  x = 13;
  x += drawTimeGlyph(x, s[3]) + 1;
  drawTimeGlyph(x, s[4]);
}

void tickClock() {
  if (millis() - lastFrame < 50) return;   // 50ms: smooth date scroll
  lastFrame = millis();
  time_t now = time(nullptr);
  struct tm t;
  localtime_r(&now, &t);

  char tbuf[8];
  bool synced = t.tm_year >= 100;
  if (synced) {
    bool colon = (millis() / 500) & 1;
    snprintf(tbuf, sizeof(tbuf), "%02d%c%02d", t.tm_hour, colon ? ':' : ' ', t.tm_min);
    parola.setIntensity((t.tm_hour < 6 || t.tm_hour >= 21) ? 0 : DEFAULT_INTENSITY);
    if (t.tm_mday != lastDay) {            // rebuild "Thursday July 23" on day change
      lastDay = t.tm_mday;
      char dbuf[40];
      strftime(dbuf, sizeof(dbuf), "%A %B %d", &t);
      dateNCols = buildColsLCD(dbuf, dateCols, sizeof(dateCols));
      dateScroll = 0;
    }
  } else {
    strlcpy(tbuf, "--:--", sizeof(tbuf));
  }

  if (timeOverride[0]) strlcpy(tbuf, timeOverride, sizeof(tbuf));   // test mode

  frameBegin();
  drawTimeLCD(tbuf);                     // original Pi clock face, modules 1-3
  if (synced && dateNCols > 0) {
    int x0 = TIME_REGION + TIME_GAP;                          // modules 4-7
    int cycle = dateNCols + DATE_GAP;
    for (int i = 0; x0 + i < PANEL_W; i++) {
      int ci = (dateScroll + i) % cycle;
      putCol(x0 + i, ci < dateNCols ? dateCols[ci] : 0);
    }
    if (frameNo & 1) dateScroll = (dateScroll + 1) % cycle;   // 100ms/col scroll
  }
  frameEnd();
  frameNo++;
}

// ---------------------------------------------------------- M_CHARSET -----
void tickCharset() {
  if (millis() - lastFrame < 100) return;
  lastFrame = millis();
  frameNo++;
  if (frameNo > 255) { switchMode(M_CLOCK); return; }
  char buf[MAX_DEVICES + 1];
  memset(buf, (char)frameNo, MAX_DEVICES);
  buf[MAX_DEVICES] = 0;
  parola.displayText(buf, PA_CENTER, 0, 0, PA_PRINT, PA_NO_EFFECT);
  parola.displayAnimate();
}

// ----------------------------------------------------------- M_PACMAN -----
int pmDir, pmX;
void tickPacman() {
  if (millis() - lastFrame < 120) return;
  lastFrame = millis();
  if (frameNo == 0) { pmDir = random(2) ? 1 : -1; pmX = (pmDir < 0) ? PANEL_W : -8; }
  const int gap = 11, gap2 = 22;
  int pacX = pmX - pmDir * gap;
  int ghostX = pmX - pmDir * gap2;
  int front = (pmDir < 0) ? pacX : pacX + 7;
  frameBegin();
  for (int p = 2; p < PANEL_W; p += 5) {
    bool ahead = (pmDir < 0) ? (p < front) : (p > front);
    if (ahead) px(p, 3);
  }
  blit(GHOST_FRAMES[frameNo % 2], ghostX);
  blit((pmDir < 0 ? PACMAN_LEFT : PACMAN_RIGHT)[frameNo % 2], pacX);
  blit(RUNNER_FRAMES[frameNo % 4], pmX);
  frameEnd();
  pmX += pmDir * 2;
  if ((pmDir < 0 && pmX < -8 - gap2) || (pmDir > 0 && pmX > PANEL_W + gap2)) {
    pmDir = random(2) ? 1 : -1;
    pmX = (pmDir < 0) ? PANEL_W : -8;
  }
  frameNo++;
}

// ----------------------------------------------------------- M_DANCER -----
void tickDancer() {
  if (millis() - lastFrame < 180) return;
  lastFrame = millis();
  const int posn[3] = {8, 24, 40};
  frameBegin();
  for (int i = 0; i < 3; i++) {
    int bob = ((frameNo + i) % 2 == 0) ? -1 : 0;
    blit(DANCER_FRAMES[(frameNo + i) % 4], posn[i], bob);
  }
  frameEnd();
  frameNo++;
}

// ------------------------------------------------------------- M_KITT -----
int kittPos = 0, kittStep = 1;
void tickKitt() {
  if (millis() - lastFrame < 30) return;
  lastFrame = millis();
  const uint8_t tail[4] = {8, 6, 4, 2};
  frameBegin();
  for (int i = 0; i < 4; i++) {
    int bx = kittPos - kittStep * i;
    if (bx < 0 || bx >= PANEL_W) continue;
    int y0 = (8 - tail[i]) / 2;
    for (int y = y0; y < y0 + tail[i]; y++) px(bx, y);
  }
  frameEnd();
  kittPos += kittStep;
  if (kittPos >= PANEL_W - 1) kittStep = -1;
  else if (kittPos <= 0) kittStep = 1;
}

// --------------------------------------------------------------- M_EQ -----
#define EQ_BARS 14
float eqPhase[EQ_BARS], eqSpeed[EQ_BARS];
void tickEq() {
  if (millis() - lastFrame < 50) return;
  lastFrame = millis();
  if (frameNo == 0)
    for (int i = 0; i < EQ_BARS; i++) {
      eqPhase[i] = random(628) / 100.0f;
      eqSpeed[i] = 0.15f + random(30) / 100.0f;
    }
  frameBegin();
  for (int i = 0; i < EQ_BARS; i++) {
    float level = sinf(eqPhase[i] + frameNo * eqSpeed[i]) * 0.5f + 0.5f;
    int h = max(1, (int)(level * 8));
    int x0 = i * 4;
    for (int y = 8 - h; y < 8; y++)
      for (int x = x0; x < x0 + 3 && x < PANEL_W; x++) px(x, y);
  }
  frameEnd();
  frameNo++;
}

