rawneo/matrix-display/esp8266/src/main.cpp
// ------------------------------------------------------------- M_RAIN -----
int8_t rainHead[PANEL_W];
uint8_t rainSpeed[PANEL_W];
void tickRain() {
  if (millis() - lastFrame < 70) return;
  lastFrame = millis();
  if (frameNo == 0)
    for (int c = 0; c < PANEL_W; c++) {
      rainHead[c] = (random(100) < 35) ? 0 : -1;
      rainSpeed[c] = random(3) ? 1 : 2;
    }
  frameBegin();
  for (int c = 0; c < PANEL_W; c++) {
    if (rainHead[c] < 0) continue;
    for (int seg = 0; seg < 3; seg++) {
      int y = rainHead[c] - seg;
      if (y >= 0 && y < 8) px(c, y);
    }
  }
  frameEnd();
  for (int c = 0; c < PANEL_W; c++) {
    if (rainHead[c] < 0) {
      if (random(100) < 5) { rainHead[c] = 0; rainSpeed[c] = random(3) ? 1 : 2; }
    } else {
      rainHead[c] += rainSpeed[c];
      if (rainHead[c] - 3 >= 8) rainHead[c] = -1;
    }
  }
  frameNo++;
}

// -------------------------------------------------------- M_FIREWORKS -----
// phase 0 = shell rising, phase 1 = ring expanding & fading
int fwPhase, fwBx, fwPeak, fwY, fwRing;
void tickFireworks() {
  uint32_t interval = (fwPhase == 0) ? 40 : 90;
  if (millis() - lastFrame < interval) return;
  lastFrame = millis();
  if (frameNo == 0) { fwPhase = 0; fwBx = random(7, PANEL_W - 7); fwPeak = random(0, 3); fwY = 7; }
  if (fwPhase == 0) {
    parola.setIntensity(0);                     // faint rising trail
    frameBegin(); px(fwBx, fwY); frameEnd();
    if (--fwY <= fwPeak) { fwPhase = 1; fwRing = 0; }
  } else {
    const int RINGS = 12;                       // expands until the next blast
    int r = fwRing + 1;
    int inten = (int)(15.0f * (1.0f - (float)fwRing / (RINGS - 1)));
    parola.setIntensity(max(0, inten));
    frameBegin();
    for (int ang = 0; ang < 360; ang += 45) {
      float rad = ang * 3.14159f / 180.0f;
      px((int)roundf(fwBx + r * cosf(rad)), (int)roundf(fwPeak + r * sinf(rad)));
    }
    frameEnd();
    if (++fwRing >= RINGS) {                    // next blast
      fwPhase = 0; fwBx = random(7, PANEL_W - 7); fwPeak = random(0, 3); fwY = 7;
    }
  }
  frameNo++;
}

// -------------------------------------------------------- M_STARFIELD -----
#define N_STARS 18
float starX[N_STARS], starSp[N_STARS];
uint8_t starY[N_STARS];
float shipX;
void tickStarfield() {
  if (millis() - lastFrame < 50) return;
  lastFrame = millis();
  if (frameNo == 0) {
    for (int i = 0; i < N_STARS; i++) {
      starX[i] = random(PANEL_W);
      starY[i] = random(8);
      starSp[i] = 0.3f + random(130) / 100.0f;
    }
    shipX = PANEL_W;
  }
  frameBegin();
  for (int i = 0; i < N_STARS; i++) px((int)starX[i], starY[i]);
  blit(SHIP, (int)shipX);
  frameEnd();
  for (int i = 0; i < N_STARS; i++) {
    starX[i] -= starSp[i];
    if (starX[i] < 0) { starX[i] = PANEL_W - 1; starY[i] = random(8); starSp[i] = 0.3f + random(130) / 100.0f; }
  }
  shipX -= 0.8f;
  if (shipX < -8) shipX = PANEL_W;
  frameNo++;
}

// -------------------------------------------------------------- M_ECG -----
void tickEcg() {
  if (millis() - lastFrame < 40) return;
  lastFrame = millis();
  frameBegin();
  int prev = pgm_read_byte(ECG_BEAT + (frameNo % 26));
  for (int x = 0; x < PANEL_W; x++) {
    int y = pgm_read_byte(ECG_BEAT + ((frameNo + x) % 26));
    int lo = min(prev, y), hi = max(prev, y);
    for (int yy = lo; yy <= hi; yy++) px(x, yy);
    prev = y;
  }
  frameEnd();
  frameNo++;
}

// -------------------------------------------------------- scroll modes ----
void tickScroll() {
  if (parola.displayAnimate()) {
    if (mode == M_IP) { switchMode(M_CLOCK); return; }
    if (mode == M_DHT && readDht(textMsg, sizeof(textMsg))) startScroll(textMsg);
    else if (mode == M_WEATHER && (frameNo % 5 == 4) && fetchWeather(textMsg, sizeof(textMsg))) startScroll(textMsg);
    else parola.displayReset();
    frameNo++;
  }
}

// ------------------------------------------------------------ web page ----
const char PAGE[] PROGMEM = R"HTML(<!doctype html>
<html lang="en" data-bs-theme="dark">
<head>
<meta charset="utf-8"><meta name="viewport" content="width=device-width, initial-scale=1">
<title>MATRIX DISPLAY</title>
<link href="https://cdn.jsdelivr.net/npm/bootstrap@5.3.2/dist/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div class="container text-center" style="max-width:900px">
  <div class="row my-4"><h1>MATRIX DISPLAY</h1></div>
  <canvas id="led" width="560" height="80" style="max-width:100%;background:#111;border-radius:8px"></canvas>
  <div class="row g-2 my-3"><div class="col-12">
    <div class="d-flex gap-2 flex-wrap flex-sm-nowrap">
      <form action="/ledtext" method="post" class="d-flex gap-2 flex-grow-1 m-0">
        <input type="text" class="form-control flex-grow-1" name="ledtext" placeholder="Enter Text">
        <input type="submit" value="Send" class="btn btn-primary flex-shrink-0">
      </form>
      <form action="/stopledtext" method="post" class="m-0 flex-shrink-0">
        <input type="submit" value="Stop" class="btn btn-danger">
      </form>
      <form action="/reboot" method="post" class="m-0 flex-shrink-0" onsubmit="return confirm('Reboot the clock?')">
        <input type="submit" value="Reboot" class="btn btn-warning">
      </form>
    </div>
  </div></div>
  <div class="row g-3 my-2 justify-content-center">
    <div class="col-6 col-md-4 col-lg"><form action="/startclock" method="post"><input type="submit" value="Clock" class="btn btn-success w-100"></form></div>
    <div class="col-6 col-md-4 col-lg"><form action="/weather" method="post"><input type="submit" value="Weather" class="btn btn-info w-100"></form></div>
    <div class="col-6 col-md-4 col-lg"><form action="/dht" method="post"><input type="submit" value="Room Temp" class="btn btn-secondary w-100"></form></div>
    <div class="col-6 col-md-4 col-lg"><form action="/charset" method="post"><input type="submit" value="Charset" class="btn btn-warning w-100"></form></div>
    <div class="col-6 col-md-4 col-lg"><form action="/pacman" method="post"><input type="submit" value="Pacman" class="btn btn-primary w-100"></form></div>
    <div class="col-6 col-md-4 col-lg"><form action="/dancer" method="post"><input type="submit" value="The Dancer" class="btn btn-primary w-100"></form></div>
  </div>
  <div class="row g-3 my-2 justify-content-center">
    <div class="col-6 col-md-4 col-lg"><form action="/kitt" method="post"><input type="submit" value="KITT" class="btn btn-danger w-100"></form></div>
    <div class="col-6 col-md-4 col-lg"><form action="/equalizer" method="post"><input type="submit" value="Equalizer" class="btn btn-success w-100"></form></div>
    <div class="col-6 col-md-4 col-lg"><form action="/rain" method="post"><input type="submit" value="Rain" class="btn btn-info w-100"></form></div>
    <div class="col-6 col-md-4 col-lg"><form action="/fireworks" method="post"><input type="submit" value="Fireworks" class="btn btn-warning w-100"></form></div>
    <div class="col-6 col-md-4 col-lg"><form action="/starfield" method="post"><input type="submit" value="Starfield" class="btn btn-secondary w-100"></form></div>
    <div class="col-6 col-md-4 col-lg"><form action="/ecg" method="post"><input type="submit" value="ECG &#10084;" class="btn btn-danger w-100"></form></div>
  </div>
</div>
<script>
const cv=document.getElementById('led'),cx=cv.getContext('2d');
async function poll(){
  try{
    const t=await (await fetch('/frame')).text();
    const p=t.split(' '),w=+p[0],h=+p[1],bits=p[2];
    cx.fillStyle='#111';cx.fillRect(0,0,cv.width,cv.height);
    const cw=cv.width/w,ch=cv.height/h;
    cx.fillStyle='#f33';
    for(let y=0;y<h;y++)for(let x=0;x<w;x++)
      if(bits[y*w+x]==='1'){cx.beginPath();cx.arc(x*cw+cw/2,y*ch+ch/2,cw*0.38,0,7);cx.fill();}
  }catch(e){}
  setTimeout(poll,300);
}
poll();
</script>
</body>
</html>)HTML";

