rawneo/matrix-display/esp8266/src/main.cpp
// --------------------------------------------------------------- routes ----
void redirectHome() {
  server.sendHeader("Location", "/");
  server.send(303, "text/plain", "");
}

void handleFrame() {
  char buf[PANEL_W * 8 + 16];
  int n = snprintf(buf, sizeof(buf), "%d 8 ", PANEL_W);
  for (int y = 0; y < 8; y++)
    for (int x = 0; x < PANEL_W; x++)
      buf[n++] = getPx(x, y) ? '1' : '0';
  buf[n] = 0;
  server.send(200, "text/plain", buf);
}

void setupRoutes() {
  server.on("/", HTTP_GET, []() { server.send_P(200, "text/html", PAGE); });
  server.on("/frame", HTTP_GET, handleFrame);
  server.on("/health", HTTP_GET, []() { server.send(200, "application/json", "{\"status\":\"ok\"}"); });
  server.on("/testtime", HTTP_POST, []() {
    String v = server.arg("t");
    if (!v.length()) v = "88:88";
    switchMode(M_CLOCK);
    strlcpy(timeOverride, v.c_str(), sizeof(timeOverride));
    server.send(200, "text/plain", timeOverride);
  });
  server.on("/dhtpin", HTTP_GET, []() {
    pinMode(DHT_PIN, INPUT);
    delay(5);
    int floatLevel = digitalRead(DHT_PIN);
    pinMode(DHT_PIN, INPUT_PULLUP);
    delay(5);
    int pullupLevel = digitalRead(DHT_PIN);
    dht.setup(DHT_PIN, DHTesp::DHT11);   // restore driver state
    char b[80];
    snprintf(b, sizeof(b), "{\"floating\":%d,\"with_pullup\":%d}", floatLevel, pullupLevel);
    server.send(200, "application/json", b);
  });
  server.on("/dhtraw", HTTP_GET, []() {
    TempAndHumidity th = dht.getTempAndHumidity();
    char b[96];
    snprintf(b, sizeof(b), "{\"status\":\"%s\",\"temp\":%.1f,\"hum\":%.1f}",
             dht.getStatusString(), th.temperature, th.humidity);
    server.send(200, "application/json", b);
  });
  server.on("/reboot", HTTP_POST, []() {
    server.send(200, "text/plain", "rebooting");
    delay(200);
    ESP.restart();
  });
  server.on("/startclock", HTTP_POST, []() { switchMode(M_CLOCK); redirectHome(); });
  server.on("/stopledtext", HTTP_POST, []() { switchMode(M_CLOCK); redirectHome(); });
  server.on("/ledtext", HTTP_POST, []() {
    String m = server.arg("ledtext");
    m.trim();
    if (m.length()) { strlcpy(textMsg, m.c_str(), sizeof(textMsg)); switchMode(M_TEXT); }
    redirectHome();
  });
  server.on("/weather", HTTP_POST, []() { switchMode(M_WEATHER); redirectHome(); });
  server.on("/dht", HTTP_POST, []() { switchMode(M_DHT); redirectHome(); });
  server.on("/charset", HTTP_POST, []() { switchMode(M_CHARSET); redirectHome(); });
  server.on("/pacman", HTTP_POST, []() { switchMode(M_PACMAN); redirectHome(); });
  server.on("/dancer", HTTP_POST, []() { switchMode(M_DANCER); redirectHome(); });
  server.on("/kitt", HTTP_POST, []() { switchMode(M_KITT); redirectHome(); });
  server.on("/equalizer", HTTP_POST, []() { switchMode(M_EQ); redirectHome(); });
  server.on("/rain", HTTP_POST, []() { switchMode(M_RAIN); redirectHome(); });
  server.on("/fireworks", HTTP_POST, []() { switchMode(M_FIREWORKS); redirectHome(); });
  server.on("/starfield", HTTP_POST, []() { switchMode(M_STARFIELD); redirectHome(); });
  server.on("/ecg", HTTP_POST, []() { switchMode(M_ECG); redirectHome(); });
  server.onNotFound([]() { server.send(404, "text/plain", "Not Found"); });
}

// ------------------------------------------------------------------ mqtt ----
// DISABLED 2026-08-12 (ENABLE_MQTT 0). The broker was the HAOS Mosquitto
// add-on on 192.168.2.20, which is powered off with the rack. PubSubClient
// connect() is NOT non-blocking as the note below claimed: it runs a TCP
// connect with WiFiClient's default 5000ms timeout, so against a dead host
// it stalled loop() for 5s out of every 10s retry cycle -- freezing the
// clock face and the date scroller, and stalling the web server with it.
// This was publish-only telemetry (no subscribes), so nothing about the
// display depended on it. /dhtraw still serves the live sensor reading.
// Set ENABLE_MQTT 1 in config.h to restore.
#if ENABLE_MQTT
// Publishes the DHT reading straight to Home Assistant, replacing the HTTP
// poller that used to scrape /dhtraw from another host. Non-blocking: it
// reconnects at most every 10s and publishes on MQTT_INTERVAL, matching the
// millis() cooperative-scheduler pattern the animation ticks already use.
//
// The two discovery payloads below must stay BYTE-IDENTICAL to what is
// retained on the broker. This HA version ignores "object_id" and derives
// entity_id from slugify(name) — prefixed by the device name when a "device"
// block is present — so there is deliberately NO device block here, and the
// names are the exact slug sources for sensor.esp8266_temperature /
// sensor.esp8266_humidity. Changing either silently breaks dashboards.
#define MQTT_DISC_TEMP "homeassistant/sensor/esp8266_temperature/config"
#define MQTT_DISC_HUM  "homeassistant/sensor/esp8266_humidity/config"

static const char DISC_TEMP[] =
  "{\"name\":\"Esp8266 Temperature\",\"state_topic\":\"esp8266/dht/temperature\","
  "\"unit_of_measurement\":\"\xC2\xB0" "C\",\"device_class\":\"temperature\","
  "\"state_class\":\"measurement\",\"unique_id\":\"esp8266_dht_temperature_final\","
  "\"expire_after\":300}";

static const char DISC_HUM[] =
  "{\"name\":\"Esp8266 Humidity\",\"state_topic\":\"esp8266/dht/humidity\","
  "\"unit_of_measurement\":\"%\",\"device_class\":\"humidity\","
  "\"state_class\":\"measurement\",\"unique_id\":\"esp8266_dht_humidity_final\","
  "\"expire_after\":300}";

uint32_t mqttLastPub = 0, mqttLastTry = 0;
bool     mqttPubPending = true;   // publish state immediately after connecting

void mqttTick() {
  if (WiFi.status() != WL_CONNECTED) return;

  if (!mqtt.connected()) {
    if (mqttLastTry && millis() - mqttLastTry < 10000) return;  // backoff
    mqttLastTry = millis();
    if (!mqtt.connect(MQTT_CLIENTID, MQTT_USER, MQTT_PASS)) return;
    // retained, so HA rebuilds the entities even on a fresh broker
    mqtt.publish(MQTT_DISC_TEMP, DISC_TEMP, true);
    mqtt.publish(MQTT_DISC_HUM,  DISC_HUM,  true);
    mqttPubPending = true;
  }

