rawneo/matrix-display/esp8266/src/main.cpp
  mqtt.loop();

  if (!mqttPubPending && millis() - mqttLastPub < MQTT_INTERVAL) return;
  mqttLastPub = millis();
  mqttPubPending = false;

  TempAndHumidity th = dht.getTempAndHumidity();
  if (dht.getStatus() != DHTesp::ERROR_NONE || isnan(th.temperature)) return;

  char b[16];
  snprintf(b, sizeof(b), "%.1f", th.temperature);
  mqtt.publish(MQTT_TOPIC_TEMP, b, true);
  snprintf(b, sizeof(b), "%.1f", th.humidity);
  mqtt.publish(MQTT_TOPIC_HUM, b, true);
}
#endif  // ENABLE_MQTT

// ---------------------------------------------------------------- setup ----

void setup() {
  Serial.begin(115200);
  randomSeed(ESP.getCycleCount());

  parola.begin();
#if ROTATE_180
  parola.setZoneEffect(0, true, PA_FLIP_UD);
  parola.setZoneEffect(0, true, PA_FLIP_LR);
#endif
  parola.setIntensity(DEFAULT_INTENSITY);
  parola.displayClear();
  mx = parola.getGraphicObject();

  dht.setup(DHT_PIN, DHTesp::DHT11);

  WiFi.mode(WIFI_STA);
  WiFi.setSleepMode(WIFI_NONE_SLEEP);
  WiFi.hostname(HOSTNAME);
#ifdef STATIC_IP
  {
    IPAddress ip(STATIC_IP), gw(STATIC_GW), mask(STATIC_MASK), dns1(STATIC_DNS), dns2(8, 8, 8, 8);
    WiFi.config(ip, gw, mask, dns1, dns2);
  }
#endif
  WiFi.begin(WIFI_SSID, WIFI_PASS);
  uint32_t t0 = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - t0 < 20000) delay(200);

  configTime(TZ_INFO, "pool.ntp.org", "time.google.com");

  ArduinoOTA.setHostname(HOSTNAME);
  ArduinoOTA.begin();

#if ENABLE_MQTT
  mqtt.setServer(MQTT_HOST, MQTT_PORT);
  mqtt.setBufferSize(512);   // discovery payloads exceed the 256-byte default
#endif

  setupRoutes();
  server.begin();

  switchMode(M_CLOCK);   // straight to the clock, no boot messages
}

// ----------------------------------------------------------------- loop ----
void loop() {
  server.handleClient();
  ArduinoOTA.handle();
  panelKeepAlive();
#if ENABLE_MQTT
  mqttTick();
#endif
  switch (mode) {
    case M_CLOCK:     tickClock();     break;
    case M_TEXT:
    case M_WEATHER:
    case M_DHT:
    case M_IP:        tickScroll();    break;
    case M_CHARSET:   tickCharset();   break;
    case M_PACMAN:    tickPacman();    break;
    case M_DANCER:    tickDancer();    break;
    case M_KITT:      tickKitt();      break;
    case M_EQ:        tickEq();        break;
    case M_RAIN:      tickRain();      break;
    case M_FIREWORKS: tickFireworks(); break;
    case M_STARFIELD: tickStarfield(); break;
    case M_ECG:       tickEcg();       break;
  }
}
